_site/2016-08-20-english-celerity.html


<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="utf-8">
    <title>单词本：速度和芹菜无关</title>
    
    <meta name="author" content="Kimi MA">

    <!-- Enable responsive viewport -->
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

    <!-- Le HTML5 shim, for IE6-8 support of HTML elements -->
    <!--[if lt IE 9]>
    <![endif]-->

    <!-- Le styles -->
    <link href="assets/themes/twitter/bootstrap/css/bootstrap.2.2.2.min.css" rel="stylesheet">
    <link href="assets/themes/twitter/css/style.css?body=1" rel="stylesheet" type="text/css" media="all">
    <link rel="shortcut icon" type="image/ico" href="/assets/favicon.ico">
    <!-- Le fav and touch icons -->
  <!-- Update these with your own images
    <link rel="shortcut icon" href="images/favicon.ico">
    <link rel="apple-touch-icon" href="images/apple-touch-icon.png">
    <link rel="apple-touch-icon" sizes="72x72" href="images/apple-touch-icon-72x72.png">
    <link rel="apple-touch-icon" sizes="114x114" href="images/apple-touch-icon-114x114.png">
  -->

    <!-- atom & rss feed -->
    <link href="/atom.xml" type="application/atom+xml" rel="alternate" title="Sitewide ATOM Feed">
    <link href="/rss.xml" type="application/rss+xml" rel="alternate" title="Sitewide RSS Feed">

  </head>

  <body>
    <div class="navbar navbar-fixed-top">
      <div class="navbar-inner">
        <div class="container-narrow">
          <a class="brand" href="/">Die Welt ist meine Vorstellung</a>
          <ul class="nav">
            
            
            


  
    
      
    
  
    
      
      	
      	<li><a href="/archive">Archive</a></li>
      	
      
    
  
    
      
    
  
    
      
      	
      	<li><a href="/categories">Topics</a></li>
      	
      
    
  
    
      
    
  
    
      
    
  
    
      
    
  
    
      
    
  
    
      
      	
      	<li><a href="/tags">Tags</a></li>
      	
      
    
  



          </ul>
        </div>
      </div>
    </div>

    <div class="container-narrow">

      <div class="content">
        

<div class="page-header">
  <h1>单词本：速度和芹菜无关 </h1>
</div>

<div class="row-fluid post-full">
  <div class="span12">
    <div class="date">
      <span>20 August 2016</span>
    </div>
    <div class="content">
      <div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> celerity</h2>
<div class="outline-text-2" id="text-1">
<p>
上次学到芹菜 celery 的时候偶遇了单词 celerity。看起来像是芹菜的某些名词属性，后来一查才知道跟芹菜没什么关系，是速度快的意思。
</p>

<p>
人需要某种联系来帮助增强记忆。
</p>

<p>
这也是为什么前段时间王宝强的新闻这么受人们关注。我觉得人们潜意识中有一种想把生活过的每一天都好好记住保存的愿望，倘若把一个普通的日子与公众人物私人生活的重大变更联结在一起，参与到讨论中去，这个普通的日子 2016 年 8 月14 日就变得很有意义了，也就很好的在记忆中保存了这一天。尽管王宝强离婚事件和普通人没有一毛钱关系。
</p>

<p>
从人的生物属性去分析，可能因为我们的头脑中的神经元是空间网状结构互相联系着的，所以用联想的方式去记忆更符合人脑的生物特性。
</p>

<p>
所以在学会了芹菜 celery 之后再顺便学一学快速celerity，就把芹菜和速度联系在一起了。这两个概念在头脑中形成关联，就很难忘记了。
</p>

<p>
While it looks a lot like celery, celerity means something that vegetables are
not — fast moving. Gossip often travels with celerity, as do children trying to
get to a big plate of cookies.<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>
</p>

<ul class="org-ul">
<li>He moved with a celerity that amazed me, when I remembered how exasperatingly
slow he could be, fooling with kites.</li>
<li>Celerity is the soul of warfare. 兵贵神速。</li>
<li>I am by no means convinced that you would be gone with such celerity. 我怎么也不信你做事情居然这么当机立断。</li>
<li>Celerity Management 灵捷管理<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>，敏捷管理（Agile Management）的另一种说法。</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> celeron</h2>
<div class="outline-text-2" id="text-2">
<p>
Intel Corporation's trade name for its family of Pentium II microprocessors
meant for use in low-end computers. <sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>
</p>

<p>
英特尔赛扬处理器。据说是命名是从芯片 cell 演变来的。但我觉得不如说是从 celerity，更能表现处理器的高速运转性能。
</p>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">3</span> accelerate</h2>
<div class="outline-text-2" id="text-3">
<p>
既然 celerity 是速度，那么 accelerate 自然就是加速之意。
</p>

<ul class="org-ul">
<li>accelerate economic growth，加速经济发展</li>
<li>Didn't you see him accelerate to an impossible speed in an impossible time?</li>
</ul>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">3.1</span> overaccelerate</h3>
<div class="outline-text-3" id="text-3-1">
<p>
过度加速。
</p>

<ul class="org-ul">
<li>But at the same time, we need to have tactical patience. And I think we need
to be careful not to overaccelerate this and actually rush to failure.<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">4</span> decelerate</h2>
<div class="outline-text-2" id="text-4">
<p>
减速；制动。
</p>

<ul class="org-ul">
<li>Sociologists are trying to adopt an approach to decelerate the growth of
population. 社会学家正试图采取某种方式减缓人口的增长速度。</li>
<li>Crude oil demand is anemic, gasoline demand has decelerated globally, and
China crude oil imports are likely to decelerate.<sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup> 原油需求匮乏（anemic
贫血症），全球汽油需求减速，中国原油进口也可能减速。</li>
</ul>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">4.1</span> deceleration</h3>
<div class="outline-text-3" id="text-4-1">
<p>
减速的名词。
</p>

<ul class="org-ul">
<li>The harder the brake pedal is pressed, the greater the car's deceleration. 刹车踩得越用力，车子减速越猛。</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">5</span> unaccelerate</h2>
<div class="outline-text-2" id="text-5">
<p>
非加速。
</p>

<ul class="org-ul">
<li>Newton's first two laws hold only when observed in unaccelerated reference
frames. 牛顿第一、第二定律只有在非加速的参照系中作观察时才是成立的。</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8"><span class="section-number-2">6</span> reaccelerate</h2>
<div class="outline-text-2" id="text-6">
<p>
accelerated again，重新加速。
</p>

<ul class="org-ul">
<li>Wells Fargo believes 'iPhone 7' will reaccelerate Apple growth, sell 80M+ this
holiday.<sup><a id="fnr.6" class="footref" href="#fn.6">6</a></sup> Wells Fargo 相信 iPhone 7 将重新加速苹果的增长，今年假期将创造
8000 万销售量。</li>
<li>As a result, he states that a new MacBook Pro could be what is needed to
reaccelerate Apple’s share gains in the market.<sup><a id="fnr.7" class="footref" href="#fn.7">7</a></sup> 新的 MacBook Pro 也将有助于重新加速苹果市场份额。</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-2">
<h2 id="orgheadline9"><span class="section-number-2">7</span> 小结</h2>
<div class="outline-text-2" id="text-7">
<p>
本文是学习芹菜 celery 的一篇跑题文章，因为 celerity 和 celery 有很高的相似度，所以顺带学习一下。celerity 快速，accelerate 加速，有加速就有过加速 overaccelerate，在加速 reaccelerate 和不加速 unaccelerate。以及减速 decelerate。
</p>

<p>
跑题文章的再跑题就是英特尔赛扬处理器型号 Celeron，看似和 celerity 没什么关系。但是联想到光子叫 photon，那快速子不就可以叫 celeron 么。这是我瞎掰的，我姑妄言之，汝亦妄听之。
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://www.vocabulary.com/dictionary/celerity">https://www.vocabulary.com/dictionary/celerity</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="http://wiki.mbalib.com/wiki/%E7%81%B5%E6%8D%B7%E7%AE%A1%E7%90%86">http://wiki.mbalib.com/wiki/%E7%81%B5%E6%8D%B7%E7%AE%A1%E7%90%86</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
<a href="http://www.dictionary.com/browse/celeron">http://www.dictionary.com/browse/celeron</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
<a href="http://www.mprnews.org/story/npr/6952481">http://www.mprnews.org/story/npr/6952481</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5">5</a></sup> <div class="footpara"><p class="footpara">
<a href="http://www.metro.us/news/oil-posts-strong-weekly-gains-analysts-say-rally-unjustified/wrlphs---ZDA0SQppX_qj2If0uuEUJg/">http://www.metro.us/news/oil-posts-strong-weekly-gains-analysts-say-rally-unjustified/wrlphs---ZDA0SQppX_qj2If0uuEUJg/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.6" class="footnum" href="#fnr.6">6</a></sup> <div class="footpara"><p class="footpara">
<a href="http://appleinsider.com/articles/16/04/26/wells-fargo-believes-iphone-7-will-reaccelerate-apple-growth-sell-80m-this-holiday">http://appleinsider.com/articles/16/04/26/wells-fargo-believes-iphone-7-will-reaccelerate-apple-growth-sell-80m-this-holiday</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.7" class="footnum" href="#fnr.7">7</a></sup> <div class="footpara"><p class="footpara">
<a href="http://zenexp.com/new-macbook-pro-with-touchscreen-to-release-after-iphone-7-event-analyst-8290269">http://zenexp.com/new-macbook-pro-with-touchscreen-to-release-after-iphone-7-event-analyst-8290269</a>
</p></div></div>


</div>
</div>

    </div>

  
    <ul class="tag_box inline">
      <li><i class="icon-folder-open"></i></li>
      
      


  
     
    	<li><a href="/categories.html#language-ref">
    		language <span>65</span>
    	</a></li>
    
  


    </ul>
    

  
    <ul class="tag_box inline">
      <li><i class="icon-tags"></i></li>
      
      


  
     
    	<li><a href="/tags.html#English-ref">English <span>46</span></a></li>
    
  



    </ul>
    

    <hr>
    <div class="pagination">
      <ul>
      
        <li class="prev"><a href="/2016-08-19-english-cauliflower" title="单词本：蔬菜之花菜">&larr; Previous</a></li>
      
        <li><a href="/archive.html">Archive</a></li>
      
        <li class="next"><a href="/2016-08-20-english-celery" title="单词本：蔬菜之芹菜">Next &rarr;</a></li>
      
      </ul>
    </div>
    <hr>
    


  <!-- Duoshuo Comment BEGIN -->
	<div class="ds-thread"></div>
<script type="text/javascript">
var duoshuoQuery = {short_name:"kimim"};
	(function() {
		var ds = document.createElement('script');
		ds.type = 'text/javascript';ds.async = true;
		ds.src = 'http://static.duoshuo.com/embed.js';
		ds.charset = 'UTF-8';
		(document.getElementsByTagName('head')[0] 
		|| document.getElementsByTagName('body')[0]).appendChild(ds);
	})();
	</script>
<!-- Duoshuo Comment END -->





  </div>
</div>


      </div>
      <hr>
      <footer>
        <p>&copy; 2018 Kimi MA,
           All right reserved.
        </p>
      </footer>

    </div>

    
  </body>
</html>

